newwms_gift/src/Documents/алкПереупаковка/алкПереупаковка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алкПереупаковка</name>
  <registerRecords>InformationRegister.алкХранилищеАкцизныхМарок</registerRecords>
  <registerRecords>InformationRegister.алкХранилищеУпаковок</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.алкПунктыРазгрузки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Упаковки</name>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИерархияУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <comment>Представление упаковки</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АкцизныеМарки</name>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.алкКлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.Марки</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтметкаВыбытия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/алкХранилищеУпаковок/алкХранилищеУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алкХранилищеУпаковок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИерархияУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/алкХранилищеАкцизныхМарок/алкХранилищеАкцизныхМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алкХранилищеАкцизныхМарок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправкаБ</name>
    <type>
      <types>CatalogRef.алкКлассификаторСправокАиБ</types>
    </type>
  </resources>
  <resources>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>CatalogRef.алкКлассификаторАлкогольнойПродукцииЕГАИС</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОтметкаВыбытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.алкПунктыРазгрузки</types>
    </type>
  </resources>
  <dimensions>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Documents/алкПереупаковка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если не ПроверитьЗаполнение() Тогда 
		Отказ =Истина;
		Сообщить("не заполнены основные реквизиты");
		Возврат;
	КонецЕсли;	
ЗаписьМарок();
ЗаписьУпаковок();

КонецПроцедуры

Процедура ЗаписьУпаковок()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алкПереупаковкаУпаковки.ИерархияУпаковки КАК ИерархияУпаковки,
		|	алкПереупаковкаУпаковки.Упаковка КАК Упаковка
		|ИЗ
		|	Документ.алкПереупаковка.Упаковки КАК алкПереупаковкаУпаковки
		|ГДЕ
		|	алкПереупаковкаУпаковки.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алкПереупаковкаУпаковки.ИерархияУпаковки,
		|	алкПереупаковкаУпаковки.Упаковка
		|ИТОГИ ПО
		|	ИерархияУпаковки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИерархияУпаковки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НаборЗаписей=РегистрыСведений.алкХранилищеУпаковок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();

	Пока ВыборкаИерархияУпаковки.Следующий() Цикл
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.Период=Дата;
		НоваяЗапись.Регистратор=Ссылка;
		НоваяЗапись.Упаковка=ВыборкаИерархияУпаковки.ИерархияУпаковки;
		
		ВыборкаДетальныеЗаписи = ВыборкаИерархияУпаковки.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяЗапись=НаборЗаписей.Добавить();
			НоваяЗапись.Период=Дата;
			НоваяЗапись.Регистратор=Ссылка;
			НоваяЗапись.Упаковка=ВыборкаДетальныеЗаписи.Упаковка;
			НоваяЗапись.ИерархияУпаковки=ВыборкаДетальныеЗаписи.ИерархияУпаковки;	
		КонецЦикла;
	КонецЦикла;
	НаборЗаписей.Записать();
	КонецПроцедуры

Процедура ЗаписьМарок()
	
	Перем НаборЗаписей, НоваяСтрока, стр;
	
	НаборЗаписей=РегистрыСведений.алкХранилищеАкцизныхМарок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	Для Каждого стр из АкцизныеМарки Цикл 
		НоваяСтрока=НаборЗаписей.Добавить();
		НоваяСтрока.Регистратор=Ссылка;
		НоваяСтрока.Период=Дата;
		НоваяСтрока.АлкогольнаяПродукция=стр.АлкогольнаяПродукция;
		НоваяСтрока.Марка=стр.Марка;
		НоваяСтрока.Организация=Организация;
		НоваяСтрока.ПунктРазгрузки=ПунктРазгрузки;
		НоваяСтрока.Упаковка=стр.Упаковка;
		НоваяСтрока.ОтметкаВыбытия=стр.ОтметкаВыбытия;
		НоваяСтрока.СправкаБ=стр.СправкаБ;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры
